# Clash Bot Workflow PR Details

## Lambda Function Versions used

| Lambda Function | Type | Artifact Version |
| --------------- | ---- | ---------------- |
| Event Publisher | Foundation | 187 |
| Event Handler | Foundation | 204 |
| Event Notifier | Foundation | 203 |
| Websocket Publisher | Foundation | 205 |
| Create Team | Team | 187 |
| Retrieve Teams | Team | 187 |
| Is Tournament Eligible | Team | 188 |

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
module.retrieve_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=retrieve_team_exec_role-development]
module.create_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=create_team_exec_role-development]
module.subscriber_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-subscriber-development]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.event_publisher_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_publisher_exec_role-development]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
data.aws_acm_certificate.issued: Reading...
module.event_notifier_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_notifier_exec_role-development]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.create_team_step_function.data.aws_caller_identity.current: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=tournament_eligibility_exec_role-development]
aws_apigatewayv2_api.clash_bot_websocket_api: Refreshing state... [id=k10wm04op6]
module.events_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-topics-development]
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
module.event_handler_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_handler_exec_role-development]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=create-team-development]
module.event_publisher_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-publisher-development]
module.event_publisher_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-publisher-Policy-development]
aws_apigatewayv2_stage.clash_bot_websocket_api_stage: Refreshing state... [id=events-development]
module.create_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-Policy-development]
module.tournament_eligibility_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/tournament-eligibility-Policy-development]
data.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.retrieve_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=retrieve-team-development]
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Refreshing state... [id=tournament-eligibility-development]
module.retrieve_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-team-Policy-development]
module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_publisher_exec_role-development-20231118000957978600000002]
module.create_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-team-development]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=tournament_eligibility_exec_role-development-20231118000958741200000004]
module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=create_team_exec_role-development-20231118000957795600000001]
module.event_notifier_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-notifier-development]
module.event_notifier_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-notifier-Policy-development]
module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=retrieve_team_exec_role-development-20231118000958206700000003]
module.event_notifier_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_notifier_exec_role-development-20231119090315299300000001]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Read complete after 0s [id=2997044669]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.aws_iam_policy.service["lambda"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-lambda]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
aws_lambda_permission.clash_bot_ws_lambda_permission: Refreshing state... [id=terraform-20231119090321485100000002]
aws_apigatewayv2_integration.clash_bot_websocket_api_integration: Refreshing state... [id=dczcm2o]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
aws_apigatewayv2_route.clash_bot_disconnection_route: Refreshing state... [id=mofj5ku]
aws_apigatewayv2_route.clash_bot_connection_route: Refreshing state... [id=w7fedob]
aws_apigatewayv2_route.clash_bot_default_route: Refreshing state... [id=abcbmf8]
module.create_team_step_function.aws_iam_policy_attachment.service["lambda"]: Refreshing state... [id=create-team-development-lambda]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=create-team-development-dynamodb]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]
aws_apigatewayv2_deployment.clash_bot_websocket_api_deployment: Refreshing state... [id=j94cin]
aws_lambda_permission.create_team_permission: Refreshing state... [id=CreateTeamPermission-development]
aws_lambda_permission.tournament_eligibility_permission: Refreshing state... [id=TournamentEligibilityPermission-development]
module.event_handler_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-handler-Policy-development]
module.event_handler_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-handler-development]
module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_handler_exec_role-development-20231118001013189900000005]
aws_lambda_event_source_mapping.event_handler_sqs_trigger: Refreshing state... [id=7fd6c898-c397-49fa-b143-76747922a919]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_stage.clash_bot_websocket_api_stage will be created
  + resource "aws_apigatewayv2_stage" "clash_bot_websocket_api_stage" {
      + api_id        = "k10wm04op6"
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + description   = "Clash Bot Workflow Websocket API stage"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "events-development"
      + tags_all      = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_lambda_permission.websocket_publisher_permission will be created
  + resource "aws_lambda_permission" "websocket_publisher_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "websocket-publisher-development"
      + id                  = (known after apply)
      + principal           = "states.amazonaws.com"
      + source_arn          = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
      + statement_id        = "WebSocketPublisherPermission-development"
      + statement_id_prefix = (known after apply)
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "this" {
      ~ definition    = jsonencode(
            {
              - Comment = "Creates a Clash Bot team for a Discord Service if the user is able to."
              - StartAt = "CheckIfTournamentIsEligible"
              - States  = {
                  - CanTeamBeCreated            = {
                      - Choices = [
                          - {
                              - BooleanEquals = false
                              - Next          = "TournamentIsNotEligible"
                              - Variable      = "$.isTournamentEligible"
                            },
                        ]
                      - Default = "CreateTeam"
                      - Type    = "Choice"
                    }
                  - CheckIfTournamentIsEligible = {
                      - Catch      = [
                          - {
                              - ErrorEquals = [
                                  - "States.ALL",
                                ]
                              - Next        = "DefaultErrorHandler"
                            },
                        ]
                      - Next       = "CanTeamBeCreated"
                      - OutputPath = "$.isEligible"
                      - Parameters = {
                          - FunctionName = "arn:aws:lambda:us-east-1:816923827429:function:tournament-eligibility-development"
                          - Payload      = {
                              - "tournamant.$"    = "$.tournament.tournamentName"
                              - "tournamentDay.$" = "$.tournament.tournamentDay"
                            }
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - ResultPath = "$.isTournamentEligible"
                      - Type       = "Task"
                    }
                  - CreateTeam                  = {
                      - Catch      = [
                          - {
                              - ErrorEquals = [
                                  - "States.ALL",
                                ]
                              - Next        = "DefaultErrorHandler"
                            },
                        ]
                      - End        = true
                      - OutputPath = "$.Payload"
                      - Parameters = {
                          - FunctionName = "arn:aws:lambda:us-east-1:816923827429:function:create-team-development"
                          - "Payload.$"  = "$"
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - Type       = "Task"
                    }
                  - DefaultErrorHandler         = {
                      - End    = true
                      - Result = "An error occurred"
                      - Type   = "Pass"
                    }
                  - TournamentIsNotEligible     = {
                      - End    = true
                      - Result = "Tournamnet is not eligible for team creation."
                      - Type   = "Pass"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
        name          = "create-team-development"
        tags          = {
            "Name" = "create-team-development"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.event_handler_lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "event-handler-development"
      ~ last_modified                  = "2023-11-18T22:25:15.000+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/event-handler/development/artifact-191.zip" -> "artifacts/event-handler/development/artifact-204.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.websocket_publisher_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the websocket-publisher lambda function."
      + id          = (known after apply)
      + name        = "websocket-publisher-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-topics-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.websocket_publisher_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "websocket_publisher_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.websocket_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "websocket_publisher_exec_role-development"
    }

  # module.websocket_publisher_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "websocket-publisher-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/websocket-publisher/development/artifact-205.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TOPIC_TO_SUBSCRIBERS_TABLE_NAME" = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-topics-development"
              + "WEBSOCKET_API_ENDPOINT"          = "wss://k10wm04op6.execute-api.us-east-1.amazonaws.com"
            }
        }
    }

Plan: 6 to add, 2 to change, 0 to destroy.
module.websocket_publisher_lambda.aws_iam_policy.policy: Creating...
module.websocket_publisher_lambda.aws_iam_role.lambda_exec_role: Creating...
aws_apigatewayv2_stage.clash_bot_websocket_api_stage: Creating...
module.websocket_publisher_lambda.aws_iam_policy.policy: Creation complete after 1s [id=arn:aws:iam::816923827429:policy/websocket-publisher-Policy-development]
module.websocket_publisher_lambda.aws_iam_role.lambda_exec_role: Creation complete after 1s [id=websocket_publisher_exec_role-development]
module.websocket_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
module.websocket_publisher_lambda.aws_lambda_function.lambda: Creating...
module.websocket_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 0s [id=websocket_publisher_exec_role-development-20231125070134113800000001]
aws_apigatewayv2_stage.clash_bot_websocket_api_stage: Creation complete after 1s [id=events-development]
module.websocket_publisher_lambda.aws_lambda_function.lambda: Still creating... [10s elapsed]
module.websocket_publisher_lambda.aws_lambda_function.lambda: Creation complete after 17s [id=websocket-publisher-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Modifying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Modifications complete after 1s [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
aws_lambda_permission.websocket_publisher_permission: Creating...
module.event_handler_lambda.aws_lambda_function.lambda: Modifying... [id=event-handler-development]
aws_lambda_permission.websocket_publisher_permission: Creation complete after 0s [id=WebSocketPublisherPermission-development]
module.event_handler_lambda.aws_lambda_function.lambda: Modifications complete after 7s [id=event-handler-development]

Apply complete! Resources: 6 added, 2 changed, 0 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
create-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:create-team-development"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-handler-development"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-publisher-development"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
retrieve-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:retrieve-team-development"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
tournament-eligibility-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:tournament-eligibility-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*